$(document).ready(function () {
    window.defaultWidth = window.innerWidth;
    window.onresize = function () {

        let x = (window.defaultWidth / window.innerWidth).toFixed(2);
        document.getElementById("circle2").style.transform = "scale(" + 1 / x + ")"
        document.getElementById("hero").style.transform = "scale(" + 1 / x + ")"
        document.getElementById("icon-button-interface").style.transform = "scale(" + 1 / x + ")"

        
        $("#circle").height(250 / x)
        $("#circle").width(250 / x)
        $("#circle").css({marginTop: -125 / x, marginLeft: -125 / x})
    }

    $("#button-interface").click(
        function (e) {
            interfaceMoveOut(e);
        }
    );

    function interfaceMoveOut(event) {
        let interfase = $("#interface"),
            flag = interfase.css("display") == "none" ? false : true;
        if (flag) {
            interfase.hide(1000);
            $("#button-interface").animate({
                left: "6%",
                top: "2%"
            })
        } else {
            interfase.show("slow");
            interfase.css("display", "flex");
            $("#button-interface").animate({
                left: "1.5%",
                top: "1.5%"
            });
        }
    }

    //Скрытие pop-container при клике за область экрана.
    $("#pop-container-info").bind("click", function (e) {
        if ($(e.target).attr("id") == "pop-container-info")
            closeWindow();
    })

    // $("#pop-container-input").bind("click", function (e) {
    //     if ($(e.target).attr("id") == "pop-container-input")
    //         closeWindow();
    // })

    //Скрытие pop-container при клике на крестик.
    $(".popup-container-close").click(() => {        
        closeWindow();
    })

    function closeWindow(){
        PENDING = false;
        what = "info";
        // console.log($("#content-explanation-info"));
        if ($("#content-explanation-info").text() == "")
            what = "input";        

        if (what == "info"){
            $("#pop-container-info").hide(750);
            $("#content-explanation-info").html("");
            $("#content-actions-info").html("");
        }
        else {
            $("#pop-container-input").hide(750);
            $("#content-explanation-input").html("");
            $("#content-actions-input").html("");
        }
    }

    function eventInfo(options){
        PENDING = true;
        let content = $("#content-explanation-info"),
            actions = $("#content-actions-info");

        if ("main" in options && "head" in options["main"] && "main" in options["main"]) {
            let P = document.createElement("P");
            P.textContent = options["main"]["head"];
            content.append(P);
            P = document.createElement("P");
            P.textContent = options["main"]["main"];
            content.append(P);

        }
        if ("buttons" in options) {
            for (let elem of options["buttons"]) {
                let button = document.createElement("button");
                button.textContent = elem["text"];
                button.className = "interface-button-action";
                button.onclick = elem["func"];
                actions.append(button);
            }
        }
        $("#pop-container-info").show(750);
    }

    function eventInput(options){
        PENDING = true;
        let content = $("#content-explanation-input"),
            actions = $("#content-actions-input");

        if ("main" in options && "head" in options["main"] && "main" in options["main"]) {
            let P = document.createElement("P");
            P.textContent = options["main"]["head"];
            content.append(P);
            P = document.createElement("P");
            P.textContent = options["main"]["main"];
            content.append(P);
        }

        let text = document.createElement("input");
        text.type = "text";
        text.id = "text";
        text.className = "textblock";
        text.placeholder = "Вводи скорей ответ, дурень!";
        actions.append(text);

        if ("buttons" in options) {
            for (let elem of options["buttons"]) {
                let button = document.createElement("button");
                button.textContent = elem["text"];
                button.className = "interface-button-action";
                button.onclick = elem["func"];
                actions.append(button);
            }
        }        

        $("#pop-container-input").show(750);
    }

//#region map
    var map = [[-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1], [-1, 1, 1, 1, 1, 1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 18, 18, 18, 18, 18, 18, 18, -1, -1, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 19, 19, 19, -1, -1, -1, -1, -1, -1], [-1, 1, 1, 1, 1, 1, -1, -1, -1, -1, 3, 3, 3, 3, 3, 3, 3, 3, -1, -1, -1, -1, -1, -1, -1, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, -1, -1, -1, -1, -1, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 19, 19, 19, 19, 19, 19, 19, -1, -1], [-1, 1, 1, 1, 1, 1, -1, -1, -1, -1, 3, 3, 3, 3, 3, 3, 3, 3, 3, -1, -1, -1, -1, -1, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, -1, -1, -1, -1, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 0, 0, 0, 0, -1, -1, -1, -1, -1, 19, 19, 19, 19, 19, 19, 19, -1, -1], [-1, 1, 1, 1, -1, -1, -1, -1, -1, -1, 3, 3, 3, 3, 3, 3, 3, 3, 3, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, -1, -1, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 0, 0, 0, 0, -1, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, -1, -1], [-1, 1, 1, 1, -1, -1, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 0, 0, 0, 0, 4, 4, 4, 4, 4, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 0, 0, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, -1, -1, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, -1, -1, -1, 0, 0, -1, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, -1, -1], [-1, 1, 1, 1, -1, -1, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, -1, -1, -1, -1, -1, 4, 4, 4, 4, 4, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, -1, 4, 4, 4, 4, 4, 4, 4, 0, 0, 18, 18, 18, 18, 18, 18, 18, 18, 18, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, 18, 18, 18, 18, -1, 18, 18, 18, 18, 18, 18, 18, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, -1], [-1, 0, 0, -1, -1, -1, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, -1, -1, -1, -1, -1, -1, 4, 4, 4, -1, -1, -1, 6, 6, 6, 6, 6, -1, -1, -1, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, -1, -1, 18, 18, 18, 18, 18, 18, 18, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 18, 18, 18, 18, 18, -1, -1, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, 19, 19, 19, 19, 19, 19, 19, 19, -1], [-1, 0, 0, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, 3, 3, 3, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 6, 6, 6, 6, 6, 6, 6, -1, -1, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, -1, -1, 18, 18, 18, 18, 18, -1, -1, -1, -1, -1, -1, -1, 0, 0, 17, 17, 17, 17, 17, 17, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 20, 20, 20, 20, 20, -1, -1, -1, -1, 19, 19, 19, 19, 19, 19, 19, -1], [-1, 0, 0, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 6, 6, 6, 6, 6, 6, 6, -1, -1, 0, 0, -1, -1, 4, 4, 4, 4, 4, 4, -1, -1, -1, 18, 18, 18, -1, -1, -1, -1, -1, -1, -1, -1, 17, 17, 17, 17, 17, 17, 17, 17, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 0, 19, 19, 19, 19, 19, 19, 19, -1], [-1, 0, 0, -1, 2, 2, 2, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, -1, -1, -1, 0, 0, -1, -1, 4, 4, 4, 4, 4, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 0, 19, 19, 19, 19, 19, 19, 19, -1], [-1, 0, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, -1, -1, -1, -1, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, -1, -1, -1, 7, 7, -1, -1, 4, 4, 4, 4, -1, -1, -1, -1, -1, 0, 0, 0, 0, 0, 0, 0, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 0, 0, 0, 0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, -1, -1, 19, 19, 19, 19, 19, 19, 19, -1], [-1, 0, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, -1, -1, 7, 7, -1, -1, 4, 4, 4, 4, -1, -1, -1, -1, -1, 0, 0, 0, 0, 0, 0, 0, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 20, 20, 20, 20, 20, 20, 20, 20, 20, -1, 19, 19, 19, 19, 19, 19, 19, -1, -1], [-1, -1, -1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, -1, -1, 7, 7, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, -1, -1, -1, -1, -1, 22, 22, 22, 22, 22, 22, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 20, 20, 20, 20, -1, 19, 19, 19, 19, 19, 19, 19, -1, -1], [-1, -1, -1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, -1, -1, -1, -1, 5, 5, 5, 5, -1, -1, -1, -1, -1, -1, 6, 6, 6, 6, 6, 6, 6, 6, -1, -1, -1, 7, 7, 7, 7, 7, -1, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, 17, 17, 17, 17, 17, 17, 17, 17, -1, -1, -1, -1, -1, -1, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, -1, -1, -1, -1, -1, -1, -1, -1, 20, 20, 20, 20, -1, 0, 0, -1, 19, 19, 19, -1, -1, -1], [-1, -1, -1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, -1, -1, -1, -1, 5, 5, 5, 5, 5, -1, -1, -1, -1, -1, -1, 6, 6, 6, 6, 6, 6, -1, -1, -1, -1, 7, 7, 7, 7, 7, -1, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, 17, 17, 17, 17, 17, 17, 17, -1, -1, -1, -1, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, -1, -1, -1, -1, -1, 20, 20, 20, 20, 20, 20, 20, -1, 19, 19, 19, -1, -1, -1], [-1, -1, -1, 2, 2, -1, 0, 0, -1, 2, 2, 2, 2, -1, -1, -1, -1, 5, 5, 5, 5, 5, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 7, 7, 7, 7, 7, -1, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, 0, 0, 17, 17, 17, -1, -1, -1, -1, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, -1, -1, -1, 20, 20, 20, 20, 20, 20, 20, -1, 19, 19, 19, -1, -1, -1], [-1, -1, -1, -1, -1, -1, 0, 0, -1, 2, 2, 2, 2, -1, -1, -1, -1, 5, 5, 5, 5, 5, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 7, 7, 7, 7, 7, -1, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, 22, 22, 22, 22, 22, 22, 22, 22, 22, -1, -1, -1, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, -1, -1, -1, 20, 20, 20, 20, 20, 20, 20, -1, 19, 19, 19, -1, -1, -1], [-1, -1, -1, -1, -1, 10, 10, 10, -1, 2, 2, 2, 2, -1, -1, -1, -1, -1, 5, 5, 5, -1, -1, -1, -1, -1, -1, -1, 8, 8, 8, 8, 8, 8, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 16, 16, 16, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 22, 22, 22, 22, 22, 22, 22, -1, -1, 20, 20, 20, 20, 20, 20, 20, -1, 19, 19, 19, -1, -1, -1], [-1, -1, -1, -1, -1, 10, 10, 10, -1, 2, 2, 2, 2, -1, -1, -1, -1, -1, 5, 5, 5, -1, 5, 5, -1, -1, -1, -1, 8, 8, 8, 8, 8, 8, 8, 8, 8, -1, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, 16, 16, 16, 16, 16, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, 22, 22, 22, 22, 22, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 22, 22, 22, 22, 22, 22, -1, -1, 20, 20, -1, 20, 20, 20, 20, -1, -1, 19, 19, -1, -1, -1], [0, 0, 0, 0, 0, 10, 10, 10, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, 5, 5, 5, 5, 5, 5, 5, 5, -1, -1, -1, -1, 8, 8, 8, 8, 8, 8, 8, -1, 0, 0, -1, -1, -1, -1, -1, -1, -1, 16, 16, 16, 16, 16, 16, 16, 16, 16, -1, -1, -1, 0, 0, 0, 0, 22, 22, 22, 22, 22, 22, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 22, 22, -1, -1, -1, -1, -1, -1, 22, 22, 22, 22, 22, -1, -1, 20, 20, -1, 20, 20, 20, 20, -1, -1, 0, 0, -1, -1, -1], [0, 0, 0, 0, 0, 10, 10, 10, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, 5, 5, 5, 5, 5, 5, 5, 5, -1, -1, -1, -1, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, -1, -1, -1, -1, -1, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, -1, -1, 0, 0, 0, 0, 22, 22, 22, 22, 22, 22, -1, -1, -1, -1, -1, -1, -1, -1, -1, 22, 22, 22, 22, -1, -1, -1, -1, -1, 22, 22, 22, 22, 22, -1, -1, 0, 0, -1, 20, 20, 20, 20, -1, -1, 0, 0, -1, -1, -1], [0, 0, 0, 0, 0, 10, 10, 10, 10, -1, -1, 0, 0, -1, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0, -1, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 0, 0, 0, 0, 16, 16, 16, 16, 16, 16, 16, -1, 16, 16, 16, 16, -1, -1, -1, -1, -1, -1, 22, 22, 22, 22, 22, 22, -1, -1, -1, -1, -1, -1, -1, -1, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1], [-1, -1, -1, -1, -1, 10, 10, 10, 10, -1, -1, 0, 0, 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0, -1, -1, -1, 8, 8, 8, 8, 8, 8, 8, 8, 8, 0, 0, 0, 0, 16, 16, 16, 16, 16, 16, -1, -1, -1, 16, 16, 16, -1, -1, -1, -1, -1, -1, -1, 22, 22, 22, 22, -1, -1, -1, -1, -1, -1, -1, -1, -1, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, -1, 28, 28, -1, -1, -1], [-1, -1, -1, -1, -1, 10, 10, 10, 10, -1, -1, 0, 0, 0, 5, 5, 5, 5, 5, 5, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, 8, 8, 8, 8, 8, 8, 8, 8, 8, -1, -1, -1, -1, -1, 16, 16, 16, 16, -1, -1, -1, -1, 16, 16, 16, 16, -1, -1, -1, -1, -1, -1, 22, 22, 22, 22, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 22, 22, 22, 22, -1, -1, -1, -1, 22, 22, 22, 22, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, 28, 28, 28, 28, 28, -1, -1], [0, 0, 0, 0, 0, 10, 10, 10, 10, -1, -1, -1, -1, -1, 5, 5, 5, 5, 0, 0, -1, -1, -1, -1, -1, -1, 9, 9, 9, 9, -1, -1, 8, 8, 8, 8, 8, -1, -1, -1, -1, -1, -1, -1, -1, -1, 16, 16, 16, 16, 16, -1, -1, -1, 16, 16, 16, 16, 16, 16, -1, -1, -1, -1, 22, 22, 22, 22, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 22, 22, -1, -1, -1, 22, 22, 22, 22, 22, 22, -1, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 28, 28, 28, 28, 28, -1, -1], [0, 0, 0, 0, 0, 10, 10, 10, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, 27, 27, -1, -1, 9, 9, 9, 9, -1, -1, 8, 8, 8, 8, 8, -1, -1, -1, 15, 15, 15, 15, -1, -1, 16, 16, 16, 16, 16, 16, -1, -1, -1, 16, 16, 16, 16, 16, -1, -1, -1, -1, 22, 22, 22, 22, 22, 22, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 22, 22, 22, 22, 22, 22, -1, -1, 0, 0, 0, 0, 0, -1, -1, -1, 28, 28, 28, 28, 28, 28, 28, -1, -1], [0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 0, 0, 27, 27, 27, 27, -1, -1, 9, 9, 9, 9, 9, 0, 8, 8, 8, 8, 8, -1, -1, 15, 15, 15, 15, 15, -1, -1, -1, -1, 16, 16, 16, 16, -1, -1, -1, -1, -1, 16, 16, 16, 16, -1, -1, -1, -1, -1, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, -1, -1, -1, -1, -1, -1, 22, 22, 22, 22, 22, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, 28, 28, 28, 28, 28, 28, 28, 28, -1], [0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, 11, 11, 11, -1, -1, -1, -1, 27, 27, 27, 27, 27, 27, -1, -1, 9, 9, 9, 9, 9, 0, 8, 8, -1, 0, 0, 0, 0, 15, 15, 15, 15, 15, 15, -1, -1, -1, -1, -1, 16, 16, 16, -1, -1, -1, -1, 16, 16, 16, 16, 0, 0, 0, -1, -1, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, -1, -1, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 28, 28, 28, 28, 28, 28, 28, 28, 28, -1], [0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, 11, 11, 11, 11, 11, -1, -1, 27, 27, 27, 27, 27, 27, -1, -1, 9, 9, 9, 9, 9, -1, 8, 8, -1, 0, 0, 0, 0, 15, 15, 15, 15, 15, 15, -1, -1, -1, -1, -1, 16, 16, 16, 16, -1, -1, -1, -1, 16, 16, 16, 0, 0, 0, -1, -1, -1, -1, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, -1, -1, -1, -1, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, 28, 28, 28, 28, 28, 28, 28, 28, 28, -1], [0, 0, -1, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, -1, -1, -1, 27, 27, 27, 27, 27, -1, -1, -1, -1, 9, 9, 9, -1, -1, -1, -1, -1, -1, -1, -1, -1, 15, 15, 15, 15, 15, -1, -1, -1, -1, -1, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, -1, 0, 0, -1, -1, -1, -1, -1, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, -1, -1, -1, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, 28, 28, 28, 28, 28, 28, 28, 28, 28, -1], [0, 0, 0, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, -1, -1, -1, 27, 27, 27, 27, 27, -1, -1, -1, -1, 9, 9, 9, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, -1, -1, 0, 0, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, 22, 22, 22, 22, 22, -1, -1, -1, -1, -1, -1, 0, 0, 0, 0, 0, -1, -1, -1, 24, 24, 24, -1, -1, -1, -1, 28, 28, 28, 28, 28, 28, 28, -1], [0, 0, 0, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 0, 0, 0, 27, 27, 27, 27, 27, -1, -1, -1, -1, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, -1, -1, -1, 14, 14, 14, 14, 14, 14, 14, -1, -1, -1, -1, -1, -1, -1, -1, 16, 16, 16, -1, -1, -1, 0, 0, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, 0, 0, 0, 0, 0, -1, -1, -1, -1, 24, 24, 24, 24, 24, -1, -1, -1, -1, 28, 28, 28, 28, 28, 28, 28, -1], [-1, -1, -1, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 0, 0, 0, 27, 27, 27, 27, 27, -1, -1, -1, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 0, 0, 14, 14, 14, 14, 14, 14, 14, 14, 14, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, 0, 0, 0, 0, 0, -1, 0, 0, 0, 24, 24, 24, 24, 24, -1, -1, -1, -1, -1, -1, 28, 28, 28, 28, 28, -1], [-1, -1, -1, -1, -1, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, -1, -1, -1, 27, 27, 27, 27, 27, -1, -1, -1, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 0, 0, 14, 14, 14, 14, 14, 14, 14, 14, 14, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, 21, 21, -1, -1, -1, -1, -1, 25, 25, -1, -1, -1, -1, 0, 0, 0, 24, 24, 24, 24, -1, -1, -1, -1, -1, -1, -1, 28, 28, 28, 28, 28, -1], [-1, -1, -1, -1, -1, 11, 11, 11, -1, -1, -1, -1, 11, 11, 11, 11, -1, -1, -1, 27, 27, 27, 27, 27, -1, -1, -1, -1, 0, 0, 9, 9, 9, 9, 9, 9, 9, 9, -1, -1, -1, 14, 14, 14, 14, 14, 14, 14, 14, 14, -1, -1, -1, -1, 26, 26, 26, -1, -1, -1, -1, -1, -1, -1, 0, 0, 0, 0, 0, 0, -1, -1, -1, 21, 21, 21, 21, 21, -1, -1, -1, 25, 25, 25, 25, -1, -1, -1, 0, 0, -1, -1, 24, 24, 24, -1, -1, -1, -1, -1, -1, -1, 28, 28, 28, 28, 28, -1], [-1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, 0, 11, 11, -1, -1, -1, 27, 27, 27, 27, 27, 27, 27, 27, 0, 0, 0, 9, 9, 9, 9, 9, 9, 9, 9, -1, -1, -1, 14, 14, 14, 14, 14, 14, 14, 14, 14, -1, -1, -1, 26, 26, 26, 26, 26, -1, -1, -1, -1, -1, -1, 0, 0, 0, 0, 0, 0, -1, -1, 21, 21, 21, 21, 21, 21, -1, -1, -1, 25, 25, 25, 25, -1, -1, -1, 0, 0, -1, -1, -1, 0, 0, -1, -1, 23, 23, 23, -1, -1, -1, 28, 28, 28, 28, -1], [-1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, 27, 27, 27, 27, 27, 27, 27, 27, 0, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 14, 14, 14, 14, 14, 14, -1, -1, 26, 26, 26, 26, 26, 26, 26, -1, -1, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, 21, 21, 21, 21, 21, 21, -1, -1, -1, 25, 25, 25, 25, 25, -1, -1, 0, 0, -1, -1, -1, 0, 0, -1, 23, 23, 23, 23, 23, 23, -1, 28, 28, 28, 28, -1], [-1, 12, 12, 12, 12, 12, 12, 12, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, 27, 27, 27, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 14, 14, 14, 14, 14, -1, -1, -1, 26, 26, 26, 26, 26, 26, 26, -1, -1, -1, -1, -1, -1, -1, -1, 25, 25, 25, -1, -1, -1, 21, 21, 21, 21, -1, -1, -1, -1, -1, 25, 25, 25, 25, -1, -1, 0, 0, -1, -1, -1, 0, 0, -1, 23, 23, 23, 23, 23, 23, -1, -1, 0, 0, -1, -1], [-1, 12, 12, 12, 12, 12, 12, 12, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, 26, 26, 26, 26, -1, -1, -1, -1, -1, -1, -1, 14, 14, 14, 14, 14, 14, 0, 0, 0, 26, 26, 26, 26, 26, 26, 26, 26, -1, -1, -1, -1, -1, -1, 25, 25, 25, 25, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 25, 25, 25, 25, 0, 0, 0, 0, -1, -1, -1, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 0, 0, 0, -1, -1], [-1, 12, 12, 12, 12, 12, 12, 12, -1, -1, 12, 12, -1, 0, 0, 0, 13, 13, 13, 13, -1, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, 26, 26, 26, 26, 26, 26, 26, -1, -1, -1, -1, -1, 14, 14, 14, 14, 14, 14, 0, 0, 0, 26, 26, 26, 26, 26, 26, 26, 26, -1, -1, -1, -1, -1, 25, 25, 25, 25, 25, 25, 25, -1, -1, -1, -1, -1, -1, -1, -1, -1, 25, 25, 25, 25, 25, 0, 0, 0, 0, -1, -1, -1, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 0, 0, 0, -1, -1], [-1, 12, 12, 12, 12, 12, 12, 12, -1, -1, 12, 12, -1, 0, 0, 0, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, -1, 0, 0, 26, 26, 26, 26, 26, 26, 26, 26, -1, -1, -1, -1, -1, 14, 14, 14, 14, 14, -1, -1, -1, 26, 26, 26, 26, 26, 26, 26, 26, -1, -1, -1, -1, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, -1, -1, 25, 25, 25, 25, 25, -1, -1, -1, -1, -1, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, -1, -1, -1, -1, -1, -1, -1], [-1, -1, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, -1, -1, -1, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 0, 0, 26, 26, 26, 26, 26, 26, 26, 26, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 26, 26, 26, 26, 26, 26, 26, 26, 26, 0, 0, 0, 0, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, -1, -1, -1, -1, -1, -1, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, -1, -1, -1, -1, -1, -1, -1], [-1, -1, -1, 12, 12, 12, 12, 12, 12, 12, 12, 12, -1, -1, -1, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 0, 0, -1, 26, 26, 26, 26, 26, 26, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 0, 0, 0, 0, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 0, 0, 0, 0, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, -1, -1, -1, -1, -1, -1, -1, -1], [-1, -1, -1, 12, 12, 12, 12, 12, 12, 12, 12, 12, -1, -1, -1, -1, 13, 13, 13, 13, 13, 13, 13, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, 26, 26, 26, 26, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, -1, -1, -1, -1, -1, 25, 25, 25, 25, 25, 25, -1, -1, -1, -1, -1, -1, 25, 25, 25, 25, 25, 25, 25, 25, 0, 0, 0, 0, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, -1, -1, -1, -1, -1, -1, -1, -1], [-1, -1, -1, 12, 12, 12, 12, 12, 12, 12, 12, 12, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 0, 0, -1, -1, -1, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, -1, -1, -1, -1, -1, -1, -1, -1, -1, 25, 25, 25, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 23, 23, 23, 23, 23, 23, 23, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1], [-1, -1, -1, -1, 12, 12, 12, 12, 12, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, 26, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 23, 23, 23, 23, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1], [-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1]]

//#endregion

    // враг подошёл -> 2 кнопки - сбежать и убить
    // храним массив путей
    // храним общий массив мобов (без х, у) и текущий {
    // х, у, задача, ответ чтобы убить, награда за убийство
    // }
    // мут - лишение факелов, перенос в начало, отбирание всего инвентаря 

    
    // мы подошли к ресурсу -> 1 поле и 1 кнопка - ввод и проверить
    // храним массив ресурсов {
    // x, y, что даёт, задача, правильный ответ, решено или нет
    // }
    // 

    // мы подошли к точке получения информации -> 
    // получить информацию о лабиринте, телепортироваться
    // храним массив точек {
    // х, у, куда телепортируется, информация, правильный ответ
    // }

    var heroX = 1,
        heroY = 21,
        heroStartX = 1,
        heroStartY = 21,
        size = $(window).width() / 108,
        deltaX = size / 4,
        deltaY = size / 2 - size * 2,
        room = -1,
        inroom = false,
        onkeypressUp = false,
        onkeypressDown = true,
        lamps = {},
        torchs = 5,
        PENDING = false,
        VARRIORS_GLOBAL = [],
        VARRIORS_CURRENT = [],
        MOVE = [],
        SHOWINFO = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28],
        VARRIORS_IN = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28],
        countTrys = 5;

    $("#hero").offset({
        top: size * heroY + deltaY,
        left: size * heroX + deltaX
    })
    $("#circle").offset({
        top: size * heroY - 109,
        left: size * heroX + deltaX - 125
    })
    $("#circle2").offset({
        top: size * heroY - 109,
        left: size * heroX + deltaX - 125
    })
    room = map[heroY][heroX];
    map[heroY][heroX] = "x";

    document.onkeydown = checkKey;
    document.onkeyup = ck;

    function move(code){
        let xx = heroX;
        let yy = heroY;

        if (code == '38') {
            if ($("#hero").position().top >= 0 && map[heroY - 1][heroX] != -1) {
                heroY -= 1;
                $(".hero").css("background", "url('source/" + "back.png" + "') no-repeat");
            }
        } else if (code == '40') {
            if ($("#hero").position().top <= $(window).height() && map[heroY + 1][heroX] != -1) {
                heroY += 1;
                $(".hero").css("background", "url('source/" + "front.png" + "') no-repeat");
            }
        } else if (code == '37') {
            if ($("#hero").position().left - size / 2 >= 0 && map[heroY][heroX - 1] != -1) {
                heroX -= 1;
                $(".hero").css("background", "url('source/" + "left.png" + "') no-repeat");
            }
        } else if (code == '39') {
            if ($("#hero").position().left + size / 2 <= $(window).width() && map[heroY][heroX + 1] != -1) {
                heroX += 1;
                $(".hero").css("background", "url('source/" + "right.png" + "') no-repeat");
            }
        } 

        if (xx == heroX && yy == heroY)
            return [false, false];

        inlastroom = inroom

        if (map[heroY][heroX] > 0)
            inroom = true;
        else
            inroom = false;

        room = map[heroY][heroX];
        map[heroY][heroX] = "x";

        $("#hero").animate({
            top: size * heroY + deltaY,
            left: size * heroX + deltaX
        }, 100);

        let x = size * heroX + deltaX < ($(window).width() - 125 / (window.defaultWidth / window.innerWidth).toFixed(2)) ?
            size * heroX + deltaX : ($(window).width() - 125 / (window.defaultWidth / window.innerWidth).toFixed(2)),

            y = size * heroY + 18 < ($(window).height() - 125 / (window.defaultWidth / window.innerWidth).toFixed(2)) ?
                size * heroY + 18 : ($(window).height() - 125 / (window.defaultWidth / window.innerWidth).toFixed(2));

        $("#circle").animate({
            left: x,
            top: y
        }, 100);

        $("#circle2").animate({
            left: x,
            top: y
        }, 100);

        return [true, !inlastroom && inroom];
    }

    function ck(e) {
        if (e.keyCode == '37' || e.keyCode == '38' || e.keyCode == '39' || e.keyCode == '40') {
            if (onkeypressUp) {
                onkeypressUp = false;
                onkeypressDown = true;
            }
        }
    }

    function checkKey(e) {
        // console.log(e.keyCode);

        if(e.keyCode == 67)
            clearAll();


        if(PENDING && e.keyCode == 27)
            closeWindow();

        if(PENDING)
            return null;

        if (e.keyCode == '90') {            
            putTorch();
            return null;            

        } else if (e.keyCode == '88') {
            getTorch();  
            return null;         
        }


        if (!onkeypressDown)
            return null;

        else {
            onkeypressDown = false;
            onkeypressUp = true;
        }

        e = e || window.event;
        map[heroY][heroX] = room;

        let isgone = true;
        if (e.keyCode == '37' || e.keyCode == '38' || e.keyCode == '39' || e.keyCode == '40') 
            isgone = move(e.keyCode);

        if (isgone[1]){
            if(room == 10)
                MOVE = [10];

            else if (room != 0 && MOVE.length > 1 && MOVE[MOVE.length - 2] == room){
                MOVE.pop(MOVE.length);
                // MOVE.pop(MOVE.length);
            }
            else if (room != 0 && (MOVE.length != 0 && MOVE[MOVE.length - 1] != room || MOVE.length == 0))
                MOVE.push(room);

            if (room in SHOWINFO)
                sayAbout();
        }     

        if (isgone[0]){
            let behind = 0;
            for (let i = 0; i < VARRIORS_CURRENT.length; i++){

                behind = Math.sqrt((heroX - VARRIORS_CURRENT[i]["x"]) * (heroX - VARRIORS_CURRENT[i]["x"]) + (heroY - VARRIORS_CURRENT[i]["y"]) * (heroY - VARRIORS_CURRENT[i]["y"]));
                if (behind <= 5)
                    VARRIORS_CURRENT[i]["div"].style.opacity = (5 - behind) / 5
                else 
                    VARRIORS_CURRENT[i]["div"].style.opacity = 0;

                if (behind <= 3)
                    attack(VARRIORS_CURRENT[i]);
            }
        }
    
    }

    function putTorch(){
        if (room != 0 && !(room in lamps) && torchs > 0){
            torchs --;
            var lamp1 = $("#circle").clone(),
                lamp2 = $("#circle2").clone();
            lamp1.appendTo("body");
            lamp2.appendTo("body");
            lamp2.css("background", "url('source/lamp.png') no-repeat");

            lamps[room] = [lamp1, lamp2];
            $("#count-item-torch").text(torchs);
        }
    }

    function getTorch(){
        if (room in lamps){
            torchs ++;
            lamps[room][0].remove();
            lamps[room][1].remove();

            delete lamps[room];
            $("#count-item-torch").text(torchs);
        }
    }

    function sayAbout(){
        if (room != 0)
            eventInfo({
                "main": {
                    "head": "Вы вошли в комнату номер " + String(room) + ".", 
                    "main":"Будьте начеку... Lorem ipsum dolor sit amet consectetur, adipisicing elit. Officia, molestiae.",
                },
                "buttons": [{
                    "text": "Окей...",
                    "func": closeWindow
                },{
                    "text": "Больше не показывать",
                    "func": function (){
                        if (room in SHOWINFO)
                            delete SHOWINFO[room];
                        closeWindow();
                    }
                }]
            });
        else 
            eventInfo({
                "main": {
                    "head": "Вы находитесь в коридоре номер " + parseInt(Math.random() * 28 + 1) + ".", 
                    "main":"Выбирайтесь из этого междумирья, здесь стены искажают пространство. Как скоро они исказят и вас до неузнаваемости?..",
                },
                "buttons": [{
                    "text": "Окей...",
                    "func": closeWindow
                }]
            });
    }

    function clearAll(){
        if (SHOWINFO.length != 0){
            SHOWINFO = [];
            eventInfo({
                "main": {
                    "head": "XAXAXA",
                    "main":"БОЛЬШЕ ТЫ НИЧЕГО НЕ УЗНАЕШЬ, ГЛУПЕЦ-ГОЛУБЕЦ!",
                },
                "buttons": [{
                    "text": "Окей...",
                    "func": closeWindow
                }]
            });
        }
    }

    $("#putTorch").click(putTorch);
    $("#getTorch").click(getTorch);
    
    $("#sayAbout").click(sayAbout);

    $("#clearAll").click(clearAll);

    
    $("#count-item-torch").text(torchs);

//#region VARRIORS init

    VARRIORS_GLOBAL.push(
        {"taks":"Lorem ipsum dolor sit amet consectetur adipisicing elit. Exercitationem aliquam facilis praesentium quibusdam rerum ipsa distinctio facere sit optio obcaecati.",
        "answer":"1",
        "prize": {
            "sand":1,
            "powred":0,
            "wick":0},
        "x": -1,
        "y": -1,
        "div":"",
        "room":0});
    VARRIORS_GLOBAL.push(
        {"taks":"Lorem ipsum dolor sit amet consectetur adipisicing elit. Exercitationem aliquam facilis praesentium quibusdam rerum ipsa distinctio facere sit optio obcaecati.",
        "answer":"2",
        "prize": {
            "sand":0,
            "powred":1,
            "wick":0},
        "x": -1,
        "y": -1,
        "div":"",
        "room":0});
    VARRIORS_GLOBAL.push(
        {"taks":"Lorem ipsum dolor sit amet consectetur adipisicing elit. Exercitationem aliquam facilis praesentium quibusdam rerum ipsa distinctio facere sit optio obcaecati.",
        "answer":"4",
        "prize": {
            "sand":0,
            "powred":0,
            "wick":1},
        "x": -1,
        "y": -1,
        "div":"",
        "room":0});
    VARRIORS_GLOBAL.push(
        {"taks":"Lorem ipsum dolor sit amet consectetur adipisicing elit. Exercitationem aliquam facilis praesentium quibusdam rerum ipsa distinctio facere sit optio obcaecati.",
        "answer":"4",
        "prize": {
            "sand":1,
            "powred":0,
            "wick":1},
        "x": -1,
        "y": -1,
        "div":"",
        "room":0});
    VARRIORS_GLOBAL.push(
        {"taks":"Lorem ipsum dolor sit amet consectetur adipisicing elit. Exercitationem aliquam facilis praesentium quibusdam rerum ipsa distinctio facere sit optio obcaecati.",
        "answer":"5",
        "prize": {
            "sand":0,
            "powred":1,
            "wick":1},
        "x": -1,
        "y": -1,
        "div":"",
        "room":0});
    VARRIORS_GLOBAL.push(
        {"taks":"Lorem ipsum dolor sit amet consectetur adipisicing elit. Exercitationem aliquam facilis praesentium quibusdam rerum ipsa distinctio facere sit optio obcaecati.",
        "answer":"6",
        "prize": {
            "sand":1,
            "powred":1,
            "wick":0},
        "x": -1,
        "y": -1,
        "div":"",
        "room":0});
    VARRIORS_GLOBAL.push(
        {"taks":"Lorem ipsum dolor sit amet consectetur adipisicing elit. Exercitationem aliquam facilis praesentium quibusdam rerum ipsa distinctio facere sit optio obcaecati.",
        "answer":"7",
        "prize": {
            "sand":0,
            "powred":0,
            "wick":0},
        "x": -1,
        "y": -1,
        "div":"",
        "room":0});
    VARRIORS_GLOBAL.push(
        {"taks":"Lorem ipsum dolor sit amet consectetur adipisicing elit. Exercitationem aliquam facilis praesentium quibusdam rerum ipsa distinctio facere sit optio obcaecati.",
        "answer":"8",
        "prize": {
            "sand":1,
            "powred":1,
            "wick":1},
        "x": -1,
        "y": -1,
        "div":"",
        "room":0});
    VARRIORS_GLOBAL.push(
        {"taks":"Lorem ipsum dolor sit amet consectetur adipisicing elit. Exercitationem aliquam facilis praesentium quibusdam rerum ipsa distinctio facere sit optio obcaecati.",
        "answer":"9",
        "prize": {
            "sand":0,
            "powred":1,
            "wick":0},
        "x": -1,
        "y": -1,
        "div":"",
        "room":0});
    VARRIORS_GLOBAL.push(
        {"taks":"Lorem ipsum dolor sit amet consectetur adipisicing elit. Exercitationem aliquam facilis praesentium quibusdam rerum ipsa distinctio facere sit optio obcaecati.",
        "answer":"10",
        "prize": {
            "sand":2,
            "powred":0,
            "wick":0},
        "x": -1,
        "y": -1,
        "div":"",
        "room":0});

    
    //#endregion


    function addVarrior(){
        if (VARRIORS_GLOBAL.length != 0) {
            let newroom = parseInt(Math.random() * 28 + 1);
            while (newroom in lamps || newroom == room || !(newroom in VARRIORS_IN))
                newroom = parseInt(Math.random() * 28 + 1);
            
            delete VARRIORS_IN[newroom];
            let vars = [];
            for (let i = 0; i < map.length; i ++){
                for (let j = 0; j < map[0].length; j ++){
                    if (map[i][j] == newroom){
                        vars.push([j, i]);
                    }
                }    
            }
            let rand = parseInt(Math.random() * vars.length);
            let xVar = vars[rand][0];
            let yVar = vars[rand][1];

            let varrior = VARRIORS_GLOBAL.pop();
            varrior["room"] = newroom;
            varrior["x"] = xVar;
            varrior["y"] = yVar;

            let div = document.createElement("div");
            div.className = "varrior";
            div.style.left = xVar * size + "px";
            div.style.top = yVar * size + "px";
            div.style.height = size + "px";
            div.style.width = size + "px";
            div.id = "varrior" + newroom;
            
            
            varrior["div"] = div;

            $("#varriors").append(div);
            VARRIORS_CURRENT.push(varrior);
        }   
    }

    for (let i in [1, 1, 1, 1, 1])
        addVarrior();

    

    function attack(varrior){
        let KILL = setTimeout(() => {
                        
            for (let i in lamps) {
                lamps[i][0].remove();
                lamps[i][1].remove();
            }
            torchs = 5;
            lamps = {};
            delete lamps[room];
            $("#count-item-torch").text(torchs);
            
            $("#hero").offset({
                top: size * heroStartY + deltaY,
                left: size * heroStartX + deltaX
            })
            $("#circle").offset({
                top: size * heroStartY - 109,
                left: size * heroStartX + deltaX - 125
            })
            $("#circle2").offset({
                top: size * heroStartY - 109,
                left: size * heroStartX + deltaX - 125
            })

            map[heroY][heroX] = room;
            room = 0;
            map[heroStartY][heroStartX] = "x";
            heroX = heroStartX;
            heroY = heroStartY;

            countTrys = 5;

            let P = document.createElement("P");
            P.textContent = "Вы УМЕРЛИ!";
            $("#content-explanation-input").append(P);

            setTimeout(() => {                 
                closeWindow();
            }, 1000);

        }, 10000);

        eventInput({
            "main": {
                "head": "МОНСТР АТАКУЕТ ТЕБЯ",
                "main":"Сейчас ты познаешь все муки ада и бездна разверзнется перед тобой!!!",
            },
            "buttons": [{
                "text": "Умри!",
                "func": function(){
                    if (countTrys > 0)
                        attack_varrior(varrior, KILL);
                }
            }]
        });  
    }

    function attack_varrior(varrior, kill){
        // console.log($("#text").val());
        // console.log(varrior["answer"]);
        if ($("#text").val() == varrior["answer"]){
            clearTimeout(kill);
            let P = document.createElement("P");
            P.textContent = "Вы победили!";
            $("#content-explanation-input").append(P);
            countTrys = 5;
            setTimeout(() => {
                // console.log(VARRIORS_CURRENT.indexOf(varrior));
                VARRIORS_CURRENT.splice(VARRIORS_CURRENT.indexOf(varrior), 1);
                addVarrior();
                varrior["div"].remove();
                closeWindow();
            }, 1000);
            console.log(VARRIORS_CURRENT);
        }
        else {
            countTrys --;
            let P = document.createElement("P");
            if (countTrys != 0)
                P.textContent = "Неверно! Пытайся ещё " + countTrys + " раз!";
            else 
                P.textContent = "Ты умрёшь.";
            $("#content-explanation-input").append(P);
        }
    }

    console.log(VARRIORS_CURRENT)        
});


